grevaillot/svd_tools/headers/STM32H7x5_CM7/rcc.h
#pragma once 

/* --- RCC: Reset and clock control --------------------------------- */

/** @defgroup rcc_registers Reset and clock control Register
@{*/

/** RCC_CR clock control register **/
#define RCC_CR			MMIO32(RCC_BASE + 0x00)
/** RCC_ICSCR RCC Internal Clock Source Calibration Register **/
#define RCC_ICSCR			MMIO32(RCC_BASE + 0x04)
/** RCC_CRRCR RCC Clock Recovery RC Register **/
#define RCC_CRRCR			MMIO32(RCC_BASE + 0x08)
/** RCC_CFGR RCC Clock Configuration Register **/
#define RCC_CFGR			MMIO32(RCC_BASE + 0x10)
/** RCC_D1CFGR RCC Domain 1 Clock Configuration Register **/
#define RCC_D1CFGR			MMIO32(RCC_BASE + 0x18)
/** RCC_D2CFGR RCC Domain 2 Clock Configuration Register **/
#define RCC_D2CFGR			MMIO32(RCC_BASE + 0x1c)
/** RCC_D3CFGR RCC Domain 3 Clock Configuration Register **/
#define RCC_D3CFGR			MMIO32(RCC_BASE + 0x20)
/** RCC_PLLCKSELR RCC PLLs Clock Source Selection Register **/
#define RCC_PLLCKSELR			MMIO32(RCC_BASE + 0x28)
/** RCC_PLLCFGR RCC PLLs Configuration Register **/
#define RCC_PLLCFGR			MMIO32(RCC_BASE + 0x2c)
/** RCC_PLL1DIVR RCC PLL1 Dividers Configuration Register **/
#define RCC_PLL1DIVR			MMIO32(RCC_BASE + 0x30)
/** RCC_PLL1FRACR RCC PLL1 Fractional Divider Register **/
#define RCC_PLL1FRACR			MMIO32(RCC_BASE + 0x34)
/** RCC_PLL2DIVR RCC PLL2 Dividers Configuration Register **/
#define RCC_PLL2DIVR			MMIO32(RCC_BASE + 0x38)
/** RCC_PLL2FRACR RCC PLL2 Fractional Divider Register **/
#define RCC_PLL2FRACR			MMIO32(RCC_BASE + 0x3c)
/** RCC_PLL3DIVR RCC PLL3 Dividers Configuration Register **/
#define RCC_PLL3DIVR			MMIO32(RCC_BASE + 0x40)
/** RCC_PLL3FRACR RCC PLL3 Fractional Divider Register **/
#define RCC_PLL3FRACR			MMIO32(RCC_BASE + 0x44)
/** RCC_D1CCIPR RCC Domain 1 Kernel Clock Configuration Register **/
#define RCC_D1CCIPR			MMIO32(RCC_BASE + 0x4c)
/** RCC_D2CCIP1R RCC Domain 2 Kernel Clock Configuration Register **/
#define RCC_D2CCIP1R			MMIO32(RCC_BASE + 0x50)
/** RCC_D2CCIP2R RCC Domain 2 Kernel Clock Configuration Register **/
#define RCC_D2CCIP2R			MMIO32(RCC_BASE + 0x54)
/** RCC_D3CCIPR RCC Domain 3 Kernel Clock Configuration Register **/
#define RCC_D3CCIPR			MMIO32(RCC_BASE + 0x58)
/** RCC_CIER RCC Clock Source Interrupt Enable Register **/
#define RCC_CIER			MMIO32(RCC_BASE + 0x60)
/** RCC_CIFR RCC Clock Source Interrupt Flag Register **/
#define RCC_CIFR			MMIO32(RCC_BASE + 0x64)
/** RCC_CICR RCC Clock Source Interrupt Clear Register **/
#define RCC_CICR			MMIO32(RCC_BASE + 0x68)
/** RCC_BDCR RCC Backup Domain Control Register **/
#define RCC_BDCR			MMIO32(RCC_BASE + 0x70)
/** RCC_CSR RCC Clock Control and Status Register **/
#define RCC_CSR			MMIO32(RCC_BASE + 0x74)
/** RCC_AHB3RSTR RCC AHB3 Reset Register **/
#define RCC_AHB3RSTR			MMIO32(RCC_BASE + 0x7c)
/** RCC_AHB1RSTR RCC AHB1 Peripheral Reset Register **/
#define RCC_AHB1RSTR			MMIO32(RCC_BASE + 0x80)
/** RCC_AHB2RSTR RCC AHB2 Peripheral Reset Register **/
#define RCC_AHB2RSTR			MMIO32(RCC_BASE + 0x84)
/** RCC_AHB4RSTR RCC AHB4 Peripheral Reset Register **/
#define RCC_AHB4RSTR			MMIO32(RCC_BASE + 0x88)
/** RCC_APB3RSTR RCC APB3 Peripheral Reset Register **/
#define RCC_APB3RSTR			MMIO32(RCC_BASE + 0x8c)
/** RCC_APB1LRSTR RCC APB1 Peripheral Reset Register **/
#define RCC_APB1LRSTR			MMIO32(RCC_BASE + 0x90)
/** RCC_APB1HRSTR RCC APB1 Peripheral Reset Register **/
#define RCC_APB1HRSTR			MMIO32(RCC_BASE + 0x94)
/** RCC_APB2RSTR RCC APB2 Peripheral Reset Register **/
#define RCC_APB2RSTR			MMIO32(RCC_BASE + 0x98)
/** RCC_APB4RSTR RCC APB4 Peripheral Reset Register **/
#define RCC_APB4RSTR			MMIO32(RCC_BASE + 0x9c)
/** RCC_GCR RCC Global Control Register **/
#define RCC_GCR			MMIO32(RCC_BASE + 0xa0)
/** RCC_D3AMR RCC D3 Autonomous mode Register **/
#define RCC_D3AMR			MMIO32(RCC_BASE + 0xa8)
/** RCC_RSR RCC Reset Status Register **/
#define RCC_RSR			MMIO32(RCC_BASE + 0xd0)
/** RCC_AHB3ENR RCC AHB3 Clock Register **/
#define RCC_AHB3ENR			MMIO32(RCC_BASE + 0xd4)
/** RCC_AHB1ENR RCC AHB1 Clock Register **/
#define RCC_AHB1ENR			MMIO32(RCC_BASE + 0xd8)
/** RCC_AHB2ENR RCC AHB2 Clock Register **/
#define RCC_AHB2ENR			MMIO32(RCC_BASE + 0xdc)
/** RCC_AHB4ENR RCC AHB4 Clock Register **/
#define RCC_AHB4ENR			MMIO32(RCC_BASE + 0xe0)
/** RCC_APB3ENR RCC APB3 Clock Register **/
#define RCC_APB3ENR			MMIO32(RCC_BASE + 0xe4)
/** RCC_APB1LENR RCC APB1 Clock Register **/
#define RCC_APB1LENR			MMIO32(RCC_BASE + 0xe8)
/** RCC_APB1HENR RCC APB1 Clock Register **/
#define RCC_APB1HENR			MMIO32(RCC_BASE + 0xec)
/** RCC_APB2ENR RCC APB2 Clock Register **/
#define RCC_APB2ENR			MMIO32(RCC_BASE + 0xf0)
/** RCC_APB4ENR RCC APB4 Clock Register **/
#define RCC_APB4ENR			MMIO32(RCC_BASE + 0xf4)
/** RCC_AHB3LPENR RCC AHB3 Sleep Clock Register **/
#define RCC_AHB3LPENR			MMIO32(RCC_BASE + 0xfc)
/** RCC_AHB1LPENR RCC AHB1 Sleep Clock Register **/
#define RCC_AHB1LPENR			MMIO32(RCC_BASE + 0x100)
/** RCC_AHB2LPENR RCC AHB2 Sleep Clock Register **/
#define RCC_AHB2LPENR			MMIO32(RCC_BASE + 0x104)
/** RCC_AHB4LPENR RCC AHB4 Sleep Clock Register **/
#define RCC_AHB4LPENR			MMIO32(RCC_BASE + 0x108)
/** RCC_APB3LPENR RCC APB3 Sleep Clock Register **/
#define RCC_APB3LPENR			MMIO32(RCC_BASE + 0x10c)
/** RCC_APB1LLPENR RCC APB1 Low Sleep Clock Register **/
#define RCC_APB1LLPENR			MMIO32(RCC_BASE + 0x110)
/** RCC_APB1HLPENR RCC APB1 High Sleep Clock Register **/
#define RCC_APB1HLPENR			MMIO32(RCC_BASE + 0x114)
/** RCC_APB2LPENR RCC APB2 Sleep Clock Register **/
#define RCC_APB2LPENR			MMIO32(RCC_BASE + 0x118)
/** RCC_APB4LPENR RCC APB4 Sleep Clock Register **/
#define RCC_APB4LPENR			MMIO32(RCC_BASE + 0x11c)
/** RCC_C1_RSR RCC Reset Status Register **/
#define RCC_C1_RSR			MMIO32(RCC_BASE + 0x130)
/** RCC_C1_AHB3ENR RCC AHB3 Clock Register **/
#define RCC_C1_AHB3ENR			MMIO32(RCC_BASE + 0x134)
/** RCC_C1_AHB1ENR RCC AHB1 Clock Register **/
#define RCC_C1_AHB1ENR			MMIO32(RCC_BASE + 0x138)
/** RCC_C1_AHB2ENR RCC AHB2 Clock Register **/
#define RCC_C1_AHB2ENR			MMIO32(RCC_BASE + 0x13c)
/** RCC_C1_AHB4ENR RCC AHB4 Clock Register **/
#define RCC_C1_AHB4ENR			MMIO32(RCC_BASE + 0x140)
/** RCC_C1_APB3ENR RCC APB3 Clock Register **/
#define RCC_C1_APB3ENR			MMIO32(RCC_BASE + 0x144)
/** RCC_C1_APB1LENR RCC APB1 Clock Register **/
#define RCC_C1_APB1LENR			MMIO32(RCC_BASE + 0x148)
/** RCC_C1_APB1HENR RCC APB1 Clock Register **/
#define RCC_C1_APB1HENR			MMIO32(RCC_BASE + 0x14c)
/** RCC_C1_APB2ENR RCC APB2 Clock Register **/
#define RCC_C1_APB2ENR			MMIO32(RCC_BASE + 0x150)
/** RCC_C1_APB4ENR RCC APB4 Clock Register **/
#define RCC_C1_APB4ENR			MMIO32(RCC_BASE + 0x154)
/** RCC_C1_AHB3LPENR RCC AHB3 Sleep Clock Register **/
#define RCC_C1_AHB3LPENR			MMIO32(RCC_BASE + 0x15c)
/** RCC_C1_AHB1LPENR RCC AHB1 Sleep Clock Register **/
#define RCC_C1_AHB1LPENR			MMIO32(RCC_BASE + 0x160)
/** RCC_C1_AHB2LPENR RCC AHB2 Sleep Clock Register **/
#define RCC_C1_AHB2LPENR			MMIO32(RCC_BASE + 0x164)
/** RCC_C1_AHB4LPENR RCC AHB4 Sleep Clock Register **/
#define RCC_C1_AHB4LPENR			MMIO32(RCC_BASE + 0x168)
/** RCC_C1_APB3LPENR RCC APB3 Sleep Clock Register **/
#define RCC_C1_APB3LPENR			MMIO32(RCC_BASE + 0x16c)
/** RCC_C1_APB1LLPENR RCC APB1 Low Sleep Clock Register **/
#define RCC_C1_APB1LLPENR			MMIO32(RCC_BASE + 0x170)
/** RCC_C1_APB1HLPENR RCC APB1 High Sleep Clock Register **/
#define RCC_C1_APB1HLPENR			MMIO32(RCC_BASE + 0x174)
/** RCC_C1_APB2LPENR RCC APB2 Sleep Clock Register **/
#define RCC_C1_APB2LPENR			MMIO32(RCC_BASE + 0x178)
/** RCC_C1_APB4LPENR RCC APB4 Sleep Clock Register **/
#define RCC_C1_APB4LPENR			MMIO32(RCC_BASE + 0x17c)

/**@}*/


