grevaillot/svd_tools/headers/STM32H7x5_CM7/rcc.h
/** @defgroup rcc_cr CR clock control register
@{*/

/** RCC_CR_PLL3RDY PLL3 clock ready flag **/
#define RCC_CR_PLL3RDY		(1 << 29)
/** RCC_CR_PLL3ON PLL3 enable **/
#define RCC_CR_PLL3ON		(1 << 28)
/** RCC_CR_PLL2RDY PLL2 clock ready flag **/
#define RCC_CR_PLL2RDY		(1 << 27)
/** RCC_CR_PLL2ON PLL2 enable **/
#define RCC_CR_PLL2ON		(1 << 26)
/** RCC_CR_PLL1RDY PLL1 clock ready flag **/
#define RCC_CR_PLL1RDY		(1 << 25)
/** RCC_CR_PLL1ON PLL1 enable **/
#define RCC_CR_PLL1ON		(1 << 24)
/** RCC_CR_HSECSSON HSE Clock Security System enable **/
#define RCC_CR_HSECSSON		(1 << 19)
/** RCC_CR_HSEBYP HSE clock bypass **/
#define RCC_CR_HSEBYP		(1 << 18)
/** RCC_CR_HSERDY HSE clock ready flag **/
#define RCC_CR_HSERDY		(1 << 17)
/** RCC_CR_HSEON HSE clock enable **/
#define RCC_CR_HSEON		(1 << 16)
/** RCC_CR_D2CKRDY D2 domain clocks ready flag **/
#define RCC_CR_D2CKRDY		(1 << 15)
/** RCC_CR_D1CKRDY D1 domain clocks ready flag **/
#define RCC_CR_D1CKRDY		(1 << 14)
/** RCC_CR_RC48RDY RC48 clock ready flag **/
#define RCC_CR_RC48RDY		(1 << 13)
/** RCC_CR_RC48ON RC48 clock enable **/
#define RCC_CR_RC48ON		(1 << 12)
/** RCC_CR_CSIKERON CSI clock enable in Stop mode **/
#define RCC_CR_CSIKERON		(1 << 9)
/** RCC_CR_CSIRDY CSI clock ready flag **/
#define RCC_CR_CSIRDY		(1 << 8)
/** RCC_CR_CSION CSI clock enable **/
#define RCC_CR_CSION		(1 << 7)
/** RCC_CR_HSIDIVF HSI divider flag **/
#define RCC_CR_HSIDIVF		(1 << 5)

#define RCC_CR_HSIDIV_SHIFT		3
#define RCC_CR_HSIDIV_MASK		0x03
/** @defgroup rcc_cr_hsidiv HSIDIV HSI clock divider
@{*/
/**@}*/

/** RCC_CR_HSIRDY HSI clock ready flag **/
#define RCC_CR_HSIRDY		(1 << 2)
/** RCC_CR_HSIKERON High Speed Internal clock enable in Stop mode **/
#define RCC_CR_HSIKERON		(1 << 1)
/** RCC_CR_HSION Internal high-speed clock enable **/
#define RCC_CR_HSION		(1 << 0)

/**@}*/

/** @defgroup rcc_icscr ICSCR RCC Internal Clock Source Calibration Register
@{*/


#define RCC_ICSCR_CSITRIM_SHIFT		26
#define RCC_ICSCR_CSITRIM_MASK		0x1f
/** @defgroup rcc_icscr_csitrim CSITRIM CSI clock trimming
@{*/
/**@}*/


#define RCC_ICSCR_CSICAL_SHIFT		18
#define RCC_ICSCR_CSICAL_MASK		0xff
/** @defgroup rcc_icscr_csical CSICAL CSI clock calibration
@{*/
/**@}*/


#define RCC_ICSCR_HSITRIM_SHIFT		12
#define RCC_ICSCR_HSITRIM_MASK		0x3f
/** @defgroup rcc_icscr_hsitrim HSITRIM HSI clock trimming
@{*/
/**@}*/


#define RCC_ICSCR_HSICAL_SHIFT		0
#define RCC_ICSCR_HSICAL_MASK		0xfff
/** @defgroup rcc_icscr_hsical HSICAL HSI clock calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_crrcr CRRCR RCC Clock Recovery RC Register
@{*/


#define RCC_CRRCR_RC48CAL_SHIFT		0
#define RCC_CRRCR_RC48CAL_MASK		0x3ff
/** @defgroup rcc_crrcr_rc48cal RC48CAL Internal RC 48 MHz clock calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cfgr CFGR RCC Clock Configuration Register
@{*/


#define RCC_CFGR_MCO2SEL_SHIFT		29
#define RCC_CFGR_MCO2SEL_MASK		0x07
/** @defgroup rcc_cfgr_mco2sel MCO2SEL Micro-controller clock output 2
@{*/
/**@}*/


#define RCC_CFGR_MCO2PRE_SHIFT		25
#define RCC_CFGR_MCO2PRE_MASK		0x0f
/** @defgroup rcc_cfgr_mco2pre MCO2PRE MCO2 prescaler
@{*/
/**@}*/


#define RCC_CFGR_MCO1SEL_SHIFT		22
#define RCC_CFGR_MCO1SEL_MASK		0x07
/** @defgroup rcc_cfgr_mco1sel MCO1SEL Micro-controller clock output 1
@{*/
/**@}*/


#define RCC_CFGR_MCO1PRE_SHIFT		18
#define RCC_CFGR_MCO1PRE_MASK		0x0f
/** @defgroup rcc_cfgr_mco1pre MCO1PRE MCO1 prescaler
@{*/
/**@}*/

/** RCC_CFGR_TIMPRE Timers clocks prescaler selection **/
#define RCC_CFGR_TIMPRE		(1 << 15)
/** RCC_CFGR_HRTIMSEL High Resolution Timer clock prescaler selection **/
#define RCC_CFGR_HRTIMSEL		(1 << 14)

#define RCC_CFGR_RTCPRE_SHIFT		8
#define RCC_CFGR_RTCPRE_MASK		0x3f
/** @defgroup rcc_cfgr_rtcpre RTCPRE HSE division factor for RTC clock
@{*/
/**@}*/

/** RCC_CFGR_STOPKERWUCK Kernel clock selection after a wake up from system Stop **/
#define RCC_CFGR_STOPKERWUCK		(1 << 7)
/** RCC_CFGR_STOPWUCK System clock selection after a wake up from system Stop **/
#define RCC_CFGR_STOPWUCK		(1 << 6)

#define RCC_CFGR_SWS_SHIFT		3
#define RCC_CFGR_SWS_MASK		0x07
/** @defgroup rcc_cfgr_sws SWS System clock switch status
@{*/
/**@}*/


#define RCC_CFGR_SW_SHIFT		0
#define RCC_CFGR_SW_MASK		0x07
/** @defgroup rcc_cfgr_sw SW System clock switch
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d1cfgr D1CFGR RCC Domain 1 Clock Configuration Register
@{*/


#define RCC_D1CFGR_D1CPRE_SHIFT		8
#define RCC_D1CFGR_D1CPRE_MASK		0x0f
/** @defgroup rcc_d1cfgr_d1cpre D1CPRE D1 domain Core prescaler
@{*/
/**@}*/


#define RCC_D1CFGR_D1PPRE_SHIFT		4
#define RCC_D1CFGR_D1PPRE_MASK		0x07
/** @defgroup rcc_d1cfgr_d1ppre D1PPRE D1 domain APB3 prescaler
@{*/
/**@}*/


#define RCC_D1CFGR_HPRE_SHIFT		0
#define RCC_D1CFGR_HPRE_MASK		0x0f
/** @defgroup rcc_d1cfgr_hpre HPRE D1 domain AHB prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d2cfgr D2CFGR RCC Domain 2 Clock Configuration Register
@{*/


#define RCC_D2CFGR_D2PPRE2_SHIFT		8
#define RCC_D2CFGR_D2PPRE2_MASK		0x07
/** @defgroup rcc_d2cfgr_d2ppre2 D2PPRE2 D2 domain APB2 prescaler
@{*/
/**@}*/


#define RCC_D2CFGR_D2PPRE1_SHIFT		4
#define RCC_D2CFGR_D2PPRE1_MASK		0x07
/** @defgroup rcc_d2cfgr_d2ppre1 D2PPRE1 D2 domain APB1 prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d3cfgr D3CFGR RCC Domain 3 Clock Configuration Register
@{*/


#define RCC_D3CFGR_D3PPRE_SHIFT		4
#define RCC_D3CFGR_D3PPRE_MASK		0x07
/** @defgroup rcc_d3cfgr_d3ppre D3PPRE D3 domain APB4 prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllckselr PLLCKSELR RCC PLLs Clock Source Selection Register
@{*/


#define RCC_PLLCKSELR_DIVM3_SHIFT		20
#define RCC_PLLCKSELR_DIVM3_MASK		0x3f
/** @defgroup rcc_pllckselr_divm3 DIVM3 Prescaler for PLL3
@{*/
/**@}*/


#define RCC_PLLCKSELR_DIVM2_SHIFT		12
#define RCC_PLLCKSELR_DIVM2_MASK		0x3f
/** @defgroup rcc_pllckselr_divm2 DIVM2 Prescaler for PLL2
@{*/
/**@}*/


#define RCC_PLLCKSELR_DIVM1_SHIFT		4
#define RCC_PLLCKSELR_DIVM1_MASK		0x3f
/** @defgroup rcc_pllckselr_divm1 DIVM1 Prescaler for PLL1
@{*/
/**@}*/


#define RCC_PLLCKSELR_PLLSRC_SHIFT		0
#define RCC_PLLCKSELR_PLLSRC_MASK		0x03
/** @defgroup rcc_pllckselr_pllsrc PLLSRC DIVMx and PLLs clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllcfgr PLLCFGR RCC PLLs Configuration Register
@{*/

/** RCC_PLLCFGR_DIVR3EN PLL3 DIVR divider output enable **/
#define RCC_PLLCFGR_DIVR3EN		(1 << 24)
/** RCC_PLLCFGR_DIVQ3EN PLL3 DIVQ divider output enable **/
#define RCC_PLLCFGR_DIVQ3EN		(1 << 23)
/** RCC_PLLCFGR_DIVP3EN PLL3 DIVP divider output enable **/
#define RCC_PLLCFGR_DIVP3EN		(1 << 22)
/** RCC_PLLCFGR_DIVR2EN PLL2 DIVR divider output enable **/
#define RCC_PLLCFGR_DIVR2EN		(1 << 21)
/** RCC_PLLCFGR_DIVQ2EN PLL2 DIVQ divider output enable **/
#define RCC_PLLCFGR_DIVQ2EN		(1 << 20)
/** RCC_PLLCFGR_DIVP2EN PLL2 DIVP divider output enable **/
#define RCC_PLLCFGR_DIVP2EN		(1 << 19)
/** RCC_PLLCFGR_DIVR1EN PLL1 DIVR divider output enable **/
#define RCC_PLLCFGR_DIVR1EN		(1 << 18)
/** RCC_PLLCFGR_DIVQ1EN PLL1 DIVQ divider output enable **/
#define RCC_PLLCFGR_DIVQ1EN		(1 << 17)
/** RCC_PLLCFGR_DIVP1EN PLL1 DIVP divider output enable **/
#define RCC_PLLCFGR_DIVP1EN		(1 << 16)

#define RCC_PLLCFGR_PLL3RGE_SHIFT		10
#define RCC_PLLCFGR_PLL3RGE_MASK		0x03
/** @defgroup rcc_pllcfgr_pll3rge PLL3RGE PLL3 input frequency range
@{*/
/**@}*/

/** RCC_PLLCFGR_PLL3VCOSEL PLL3 VCO selection **/
#define RCC_PLLCFGR_PLL3VCOSEL		(1 << 9)
/** RCC_PLLCFGR_PLL3FRACEN PLL3 fractional latch enable **/
#define RCC_PLLCFGR_PLL3FRACEN		(1 << 8)

