grevaillot/svd_tools/headers/STM32H7x5_CM7/rcc.h
#define RCC_PLLCFGR_PLL2RGE_SHIFT		6
#define RCC_PLLCFGR_PLL2RGE_MASK		0x03
/** @defgroup rcc_pllcfgr_pll2rge PLL2RGE PLL2 input frequency range
@{*/
/**@}*/

/** RCC_PLLCFGR_PLL2VCOSEL PLL2 VCO selection **/
#define RCC_PLLCFGR_PLL2VCOSEL		(1 << 5)
/** RCC_PLLCFGR_PLL2FRACEN PLL2 fractional latch enable **/
#define RCC_PLLCFGR_PLL2FRACEN		(1 << 4)

#define RCC_PLLCFGR_PLL1RGE_SHIFT		2
#define RCC_PLLCFGR_PLL1RGE_MASK		0x03
/** @defgroup rcc_pllcfgr_pll1rge PLL1RGE PLL1 input frequency range
@{*/
/**@}*/

/** RCC_PLLCFGR_PLL1VCOSEL PLL1 VCO selection **/
#define RCC_PLLCFGR_PLL1VCOSEL		(1 << 1)
/** RCC_PLLCFGR_PLL1FRACEN PLL1 fractional latch enable **/
#define RCC_PLLCFGR_PLL1FRACEN		(1 << 0)

/**@}*/

/** @defgroup rcc_pll1divr PLL1DIVR RCC PLL1 Dividers Configuration Register
@{*/


#define RCC_PLL1DIVR_DIVR1_SHIFT		24
#define RCC_PLL1DIVR_DIVR1_MASK		0x7f
/** @defgroup rcc_pll1divr_divr1 DIVR1 PLL1 DIVR division factor
@{*/
/**@}*/


#define RCC_PLL1DIVR_DIVQ1_SHIFT		16
#define RCC_PLL1DIVR_DIVQ1_MASK		0x7f
/** @defgroup rcc_pll1divr_divq1 DIVQ1 PLL1 DIVQ division factor
@{*/
/**@}*/


#define RCC_PLL1DIVR_DIVP1_SHIFT		9
#define RCC_PLL1DIVR_DIVP1_MASK		0x7f
/** @defgroup rcc_pll1divr_divp1 DIVP1 PLL1 DIVP division factor
@{*/
/**@}*/


#define RCC_PLL1DIVR_DIVN1_SHIFT		0
#define RCC_PLL1DIVR_DIVN1_MASK		0x1ff
/** @defgroup rcc_pll1divr_divn1 DIVN1 Multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll1fracr PLL1FRACR RCC PLL1 Fractional Divider Register
@{*/


#define RCC_PLL1FRACR_FRACN1_SHIFT		3
#define RCC_PLL1FRACR_FRACN1_MASK		0x1fff
/** @defgroup rcc_pll1fracr_fracn1 FRACN1 Fractional part of the multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll2divr PLL2DIVR RCC PLL2 Dividers Configuration Register
@{*/


#define RCC_PLL2DIVR_DIVR1_SHIFT		24
#define RCC_PLL2DIVR_DIVR1_MASK		0x7f
/** @defgroup rcc_pll2divr_divr1 DIVR1 PLL1 DIVR division factor
@{*/
/**@}*/


#define RCC_PLL2DIVR_DIVQ1_SHIFT		16
#define RCC_PLL2DIVR_DIVQ1_MASK		0x7f
/** @defgroup rcc_pll2divr_divq1 DIVQ1 PLL1 DIVQ division factor
@{*/
/**@}*/


#define RCC_PLL2DIVR_DIVP1_SHIFT		9
#define RCC_PLL2DIVR_DIVP1_MASK		0x7f
/** @defgroup rcc_pll2divr_divp1 DIVP1 PLL1 DIVP division factor
@{*/
/**@}*/


#define RCC_PLL2DIVR_DIVN1_SHIFT		0
#define RCC_PLL2DIVR_DIVN1_MASK		0x1ff
/** @defgroup rcc_pll2divr_divn1 DIVN1 Multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll2fracr PLL2FRACR RCC PLL2 Fractional Divider Register
@{*/


#define RCC_PLL2FRACR_FRACN2_SHIFT		3
#define RCC_PLL2FRACR_FRACN2_MASK		0x1fff
/** @defgroup rcc_pll2fracr_fracn2 FRACN2 Fractional part of the multiplication factor for PLL VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll3divr PLL3DIVR RCC PLL3 Dividers Configuration Register
@{*/


#define RCC_PLL3DIVR_DIVR3_SHIFT		24
#define RCC_PLL3DIVR_DIVR3_MASK		0x7f
/** @defgroup rcc_pll3divr_divr3 DIVR3 PLL DIVR division factor
@{*/
/**@}*/


#define RCC_PLL3DIVR_DIVQ3_SHIFT		16
#define RCC_PLL3DIVR_DIVQ3_MASK		0x7f
/** @defgroup rcc_pll3divr_divq3 DIVQ3 PLL DIVQ division factor
@{*/
/**@}*/


#define RCC_PLL3DIVR_DIVP3_SHIFT		9
#define RCC_PLL3DIVR_DIVP3_MASK		0x7f
/** @defgroup rcc_pll3divr_divp3 DIVP3 PLL DIVP division factor
@{*/
/**@}*/


#define RCC_PLL3DIVR_DIVN3_SHIFT		0
#define RCC_PLL3DIVR_DIVN3_MASK		0x1ff
/** @defgroup rcc_pll3divr_divn3 DIVN3 Multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll3fracr PLL3FRACR RCC PLL3 Fractional Divider Register
@{*/


#define RCC_PLL3FRACR_FRACN3_SHIFT		3
#define RCC_PLL3FRACR_FRACN3_MASK		0x1fff
/** @defgroup rcc_pll3fracr_fracn3 FRACN3 Fractional part of the multiplication factor for PLL3 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d1ccipr D1CCIPR RCC Domain 1 Kernel Clock Configuration Register
@{*/


#define RCC_D1CCIPR_CKPERSRC_SHIFT		28
#define RCC_D1CCIPR_CKPERSRC_MASK		0x03
/** @defgroup rcc_d1ccipr_ckpersrc CKPERSRC per_ck clock source selection
@{*/
/**@}*/

/** RCC_D1CCIPR_SDMMCSRC SDMMC kernel clock source selection **/
#define RCC_D1CCIPR_SDMMCSRC		(1 << 16)

#define RCC_D1CCIPR_QSPISRC_SHIFT		4
#define RCC_D1CCIPR_QSPISRC_MASK		0x03
/** @defgroup rcc_d1ccipr_qspisrc QSPISRC QUADSPI kernel clock source selection
@{*/
/**@}*/


#define RCC_D1CCIPR_FMCSRC_SHIFT		0
#define RCC_D1CCIPR_FMCSRC_MASK		0x03
/** @defgroup rcc_d1ccipr_fmcsrc FMCSRC FMC kernel clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d2ccip1r D2CCIP1R RCC Domain 2 Kernel Clock Configuration Register
@{*/

/** RCC_D2CCIP1R_SWPSRC SWPMI kernel clock source selection **/
#define RCC_D2CCIP1R_SWPSRC		(1 << 31)

#define RCC_D2CCIP1R_FDCANSRC_SHIFT		28
#define RCC_D2CCIP1R_FDCANSRC_MASK		0x03
/** @defgroup rcc_d2ccip1r_fdcansrc FDCANSRC FDCAN kernel clock source selection
@{*/
/**@}*/

/** RCC_D2CCIP1R_DFSDM1SRC DFSDM1 kernel Clk clock source selection **/
#define RCC_D2CCIP1R_DFSDM1SRC		(1 << 24)

#define RCC_D2CCIP1R_SPDIFSRC_SHIFT		20
#define RCC_D2CCIP1R_SPDIFSRC_MASK		0x03
/** @defgroup rcc_d2ccip1r_spdifsrc SPDIFSRC SPDIFRX kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SPI45SRC_SHIFT		16
#define RCC_D2CCIP1R_SPI45SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_spi45src SPI45SRC SPI4 and 5 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SPI123SRC_SHIFT		12
#define RCC_D2CCIP1R_SPI123SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_spi123src SPI123SRC SPI/I2S1,2 and 3 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SAI23SRC_SHIFT		6
#define RCC_D2CCIP1R_SAI23SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_sai23src SAI23SRC SAI2 and SAI3 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SAI1SRC_SHIFT		0
#define RCC_D2CCIP1R_SAI1SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_sai1src SAI1SRC SAI1 and DFSDM1 kernel Aclk clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d2ccip2r D2CCIP2R RCC Domain 2 Kernel Clock Configuration Register
@{*/


#define RCC_D2CCIP2R_LPTIM1SRC_SHIFT		28
#define RCC_D2CCIP2R_LPTIM1SRC_MASK		0x07
/** @defgroup rcc_d2ccip2r_lptim1src LPTIM1SRC LPTIM1 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_CECSRC_SHIFT		22
#define RCC_D2CCIP2R_CECSRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_cecsrc CECSRC HDMI-CEC kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_USBSRC_SHIFT		20
#define RCC_D2CCIP2R_USBSRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_usbsrc USBSRC USBOTG 1 and 2 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_I2C123SRC_SHIFT		12
#define RCC_D2CCIP2R_I2C123SRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_i2c123src I2C123SRC I2C1,2,3 kernel clock source selection
@{*/
/**@}*/


