grevaillot/svd_tools/headers/STM32H7x5_CM7/rcc.h
#define RCC_D2CCIP2R_RNGSRC_SHIFT		8
#define RCC_D2CCIP2R_RNGSRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_rngsrc RNGSRC RNG kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_USART16SRC_SHIFT		3
#define RCC_D2CCIP2R_USART16SRC_MASK		0x07
/** @defgroup rcc_d2ccip2r_usart16src USART16SRC USART1 and 6 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_USART234578SRC_SHIFT		0
#define RCC_D2CCIP2R_USART234578SRC_MASK		0x07
/** @defgroup rcc_d2ccip2r_usart234578src USART234578SRC USART2/3, UART4,5, 7/8 (APB1) kernel clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d3ccipr D3CCIPR RCC Domain 3 Kernel Clock Configuration Register
@{*/


#define RCC_D3CCIPR_SPI6SRC_SHIFT		28
#define RCC_D3CCIPR_SPI6SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_spi6src SPI6SRC SPI6 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_SAI4BSRC_SHIFT		24
#define RCC_D3CCIPR_SAI4BSRC_MASK		0x07
/** @defgroup rcc_d3ccipr_sai4bsrc SAI4BSRC Sub-Block B of SAI4 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_SAI4ASRC_SHIFT		21
#define RCC_D3CCIPR_SAI4ASRC_MASK		0x07
/** @defgroup rcc_d3ccipr_sai4asrc SAI4ASRC Sub-Block A of SAI4 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_ADCSRC_SHIFT		16
#define RCC_D3CCIPR_ADCSRC_MASK		0x03
/** @defgroup rcc_d3ccipr_adcsrc ADCSRC SAR ADC kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_LPTIM345SRC_SHIFT		13
#define RCC_D3CCIPR_LPTIM345SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_lptim345src LPTIM345SRC LPTIM3,4,5 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_LPTIM2SRC_SHIFT		10
#define RCC_D3CCIPR_LPTIM2SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_lptim2src LPTIM2SRC LPTIM2 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_I2C4SRC_SHIFT		8
#define RCC_D3CCIPR_I2C4SRC_MASK		0x03
/** @defgroup rcc_d3ccipr_i2c4src I2C4SRC I2C4 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_LPUART1SRC_SHIFT		0
#define RCC_D3CCIPR_LPUART1SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_lpuart1src LPUART1SRC LPUART1 kernel clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER RCC Clock Source Interrupt Enable Register
@{*/

/** RCC_CIER_LSECSSIE LSE clock security system Interrupt Enable **/
#define RCC_CIER_LSECSSIE		(1 << 9)
/** RCC_CIER_PLL3RDYIE PLL3 ready Interrupt Enable **/
#define RCC_CIER_PLL3RDYIE		(1 << 8)
/** RCC_CIER_PLL2RDYIE PLL2 ready Interrupt Enable **/
#define RCC_CIER_PLL2RDYIE		(1 << 7)
/** RCC_CIER_PLL1RDYIE PLL1 ready Interrupt Enable **/
#define RCC_CIER_PLL1RDYIE		(1 << 6)
/** RCC_CIER_RC48RDYIE RC48 ready Interrupt Enable **/
#define RCC_CIER_RC48RDYIE		(1 << 5)
/** RCC_CIER_CSIRDYIE CSI ready Interrupt Enable **/
#define RCC_CIER_CSIRDYIE		(1 << 4)
/** RCC_CIER_HSERDYIE HSE ready Interrupt Enable **/
#define RCC_CIER_HSERDYIE		(1 << 3)
/** RCC_CIER_HSIRDYIE HSI ready Interrupt Enable **/
#define RCC_CIER_HSIRDYIE		(1 << 2)
/** RCC_CIER_LSERDYIE LSE ready Interrupt Enable **/
#define RCC_CIER_LSERDYIE		(1 << 1)
/** RCC_CIER_LSIRDYIE LSI ready Interrupt Enable **/
#define RCC_CIER_LSIRDYIE		(1 << 0)

/**@}*/

/** @defgroup rcc_cifr CIFR RCC Clock Source Interrupt Flag Register
@{*/

/** RCC_CIFR_HSECSSF HSE clock security system Interrupt Flag **/
#define RCC_CIFR_HSECSSF		(1 << 10)
/** RCC_CIFR_LSECSSF LSE clock security system Interrupt Flag **/
#define RCC_CIFR_LSECSSF		(1 << 9)
/** RCC_CIFR_PLL3RDYF PLL3 ready Interrupt Flag **/
#define RCC_CIFR_PLL3RDYF		(1 << 8)
/** RCC_CIFR_PLL2RDYF PLL2 ready Interrupt Flag **/
#define RCC_CIFR_PLL2RDYF		(1 << 7)
/** RCC_CIFR_PLL1RDYF PLL1 ready Interrupt Flag **/
#define RCC_CIFR_PLL1RDYF		(1 << 6)
/** RCC_CIFR_RC48RDYF RC48 ready Interrupt Flag **/
#define RCC_CIFR_RC48RDYF		(1 << 5)
/** RCC_CIFR_CSIRDY CSI ready Interrupt Flag **/
#define RCC_CIFR_CSIRDY		(1 << 4)
/** RCC_CIFR_HSERDYF HSE ready Interrupt Flag **/
#define RCC_CIFR_HSERDYF		(1 << 3)
/** RCC_CIFR_HSIRDYF HSI ready Interrupt Flag **/
#define RCC_CIFR_HSIRDYF		(1 << 2)
/** RCC_CIFR_LSERDYF LSE ready Interrupt Flag **/
#define RCC_CIFR_LSERDYF		(1 << 1)
/** RCC_CIFR_LSIRDYF LSI ready Interrupt Flag **/
#define RCC_CIFR_LSIRDYF		(1 << 0)

/**@}*/

/** @defgroup rcc_cicr CICR RCC Clock Source Interrupt Clear Register
@{*/

/** RCC_CICR_HSECSSC HSE clock security system Interrupt Clear **/
#define RCC_CICR_HSECSSC		(1 << 10)
/** RCC_CICR_LSECSSC LSE clock security system Interrupt Clear **/
#define RCC_CICR_LSECSSC		(1 << 9)
/** RCC_CICR_PLL3RDYC PLL3 ready Interrupt Clear **/
#define RCC_CICR_PLL3RDYC		(1 << 8)
/** RCC_CICR_PLL2RDYC PLL2 ready Interrupt Clear **/
#define RCC_CICR_PLL2RDYC		(1 << 7)
/** RCC_CICR_PLL1RDYC PLL1 ready Interrupt Clear **/
#define RCC_CICR_PLL1RDYC		(1 << 6)
/** RCC_CICR_RC48RDYC RC48 ready Interrupt Clear **/
#define RCC_CICR_RC48RDYC		(1 << 5)
/** RCC_CICR_HSE_ready_Interrupt_Clear CSI ready Interrupt Clear **/
#define RCC_CICR_HSE_ready_Interrupt_Clear		(1 << 4)
/** RCC_CICR_HSERDYC HSE ready Interrupt Clear **/
#define RCC_CICR_HSERDYC		(1 << 3)
/** RCC_CICR_HSIRDYC HSI ready Interrupt Clear **/
#define RCC_CICR_HSIRDYC		(1 << 2)
/** RCC_CICR_LSERDYC LSE ready Interrupt Clear **/
#define RCC_CICR_LSERDYC		(1 << 1)
/** RCC_CICR_LSIRDYC LSI ready Interrupt Clear **/
#define RCC_CICR_LSIRDYC		(1 << 0)

/**@}*/

/** @defgroup rcc_bdcr BDCR RCC Backup Domain Control Register
@{*/

/** RCC_BDCR_VSWRST VSwitch domain software reset **/
#define RCC_BDCR_VSWRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

#define RCC_BDCR_RTCSRC_SHIFT		8
#define RCC_BDCR_RTCSRC_MASK		0x03
/** @defgroup rcc_bdcr_rtcsrc RTCSRC RTC clock source selection
@{*/
/**@}*/

/** RCC_BDCR_LSECSSD LSE clock security system failure detection **/
#define RCC_BDCR_LSECSSD		(1 << 6)
/** RCC_BDCR_LSECSSON LSE clock security system enable **/
#define RCC_BDCR_LSECSSON		(1 << 5)

#define RCC_BDCR_LSEDRV_SHIFT		3
#define RCC_BDCR_LSEDRV_MASK		0x03
/** @defgroup rcc_bdcr_lsedrv LSEDRV LSE oscillator driving capability
@{*/
/**@}*/

