grevaillot/svd_tools/headers/STM32H7x5_CM7/rcc.h
/** RCC_APB4ENR_SAI4EN SAI4 Peripheral Clocks Enable **/
#define RCC_APB4ENR_SAI4EN		(1 << 21)
/** RCC_APB4ENR_RTCAPBEN RTC APB Clock Enable **/
#define RCC_APB4ENR_RTCAPBEN		(1 << 16)
/** RCC_APB4ENR_VREFEN VREF peripheral clock enable **/
#define RCC_APB4ENR_VREFEN		(1 << 15)
/** RCC_APB4ENR_COMP12EN COMP1/2 peripheral clock enable **/
#define RCC_APB4ENR_COMP12EN		(1 << 14)
/** RCC_APB4ENR_LPTIM5EN LPTIM5 Peripheral Clocks Enable **/
#define RCC_APB4ENR_LPTIM5EN		(1 << 12)
/** RCC_APB4ENR_LPTIM4EN LPTIM4 Peripheral Clocks Enable **/
#define RCC_APB4ENR_LPTIM4EN		(1 << 11)
/** RCC_APB4ENR_LPTIM3EN LPTIM3 Peripheral Clocks Enable **/
#define RCC_APB4ENR_LPTIM3EN		(1 << 10)
/** RCC_APB4ENR_LPTIM2EN LPTIM2 Peripheral Clocks Enable **/
#define RCC_APB4ENR_LPTIM2EN		(1 << 9)
/** RCC_APB4ENR_I2C4EN I2C4 Peripheral Clocks Enable **/
#define RCC_APB4ENR_I2C4EN		(1 << 7)
/** RCC_APB4ENR_SPI6EN SPI6 Peripheral Clocks Enable **/
#define RCC_APB4ENR_SPI6EN		(1 << 5)
/** RCC_APB4ENR_LPUART1EN LPUART1 Peripheral Clocks Enable **/
#define RCC_APB4ENR_LPUART1EN		(1 << 3)
/** RCC_APB4ENR_SYSCFGEN SYSCFG peripheral clock enable **/
#define RCC_APB4ENR_SYSCFGEN		(1 << 1)

/**@}*/

/** @defgroup rcc_ahb3lpenr AHB3LPENR RCC AHB3 Sleep Clock Register
@{*/

/** RCC_AHB3LPENR_AXISRAMLPEN AXISRAM Block Clock Enable During CSleep mode **/
#define RCC_AHB3LPENR_AXISRAMLPEN		(1 << 31)
/** RCC_AHB3LPENR_ITCMLPEN D1ITCM Block Clock Enable During CSleep mode **/
#define RCC_AHB3LPENR_ITCMLPEN		(1 << 30)
/** RCC_AHB3LPENR_DTCM2LPEN D1 DTCM2 Block Clock Enable During CSleep mode **/
#define RCC_AHB3LPENR_DTCM2LPEN		(1 << 29)
/** RCC_AHB3LPENR_D1DTCM1LPEN D1DTCM1 Block Clock Enable During CSleep mode **/
#define RCC_AHB3LPENR_D1DTCM1LPEN		(1 << 28)
/** RCC_AHB3LPENR_SDMMC1LPEN SDMMC1 and SDMMC1 Delay Clock Enable During CSleep Mode **/
#define RCC_AHB3LPENR_SDMMC1LPEN		(1 << 16)
/** RCC_AHB3LPENR_QSPILPEN QUADSPI and QUADSPI Delay Clock Enable During CSleep Mode **/
#define RCC_AHB3LPENR_QSPILPEN		(1 << 14)
/** RCC_AHB3LPENR_FMCLPEN FMC Peripheral Clocks Enable During CSleep Mode **/
#define RCC_AHB3LPENR_FMCLPEN		(1 << 12)
/** RCC_AHB3LPENR_FLITFLPEN FLITF Clock Enable During CSleep Mode **/
#define RCC_AHB3LPENR_FLITFLPEN		(1 << 8)
/** RCC_AHB3LPENR_JPGDECLPEN JPGDEC Clock Enable During CSleep Mode **/
#define RCC_AHB3LPENR_JPGDECLPEN		(1 << 5)
/** RCC_AHB3LPENR_DMA2DLPEN DMA2D Clock Enable During CSleep Mode **/
#define RCC_AHB3LPENR_DMA2DLPEN		(1 << 4)
/** RCC_AHB3LPENR_MDMALPEN MDMA Clock Enable During CSleep Mode **/
#define RCC_AHB3LPENR_MDMALPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1lpenr AHB1LPENR RCC AHB1 Sleep Clock Register
@{*/

/** RCC_AHB1LPENR_USB2ULPILPEN USB_PHY2 clocks enable during CSleep mode **/
#define RCC_AHB1LPENR_USB2ULPILPEN		(1 << 28)
/** RCC_AHB1LPENR_USB2OTGLPEN USB2OTG peripheral clock enable during CSleep mode **/
#define RCC_AHB1LPENR_USB2OTGLPEN		(1 << 27)
/** RCC_AHB1LPENR_USB1ULPILPEN USB_PHY1 clock enable during CSleep mode **/
#define RCC_AHB1LPENR_USB1ULPILPEN		(1 << 26)
/** RCC_AHB1LPENR_USB1OTGLPEN USB1OTG peripheral clock enable during CSleep mode **/
#define RCC_AHB1LPENR_USB1OTGLPEN		(1 << 25)
/** RCC_AHB1LPENR_ETH1RXLPEN Ethernet Reception Clock Enable During CSleep Mode **/
#define RCC_AHB1LPENR_ETH1RXLPEN		(1 << 17)
/** RCC_AHB1LPENR_ETH1TXLPEN Ethernet Transmission Clock Enable During CSleep Mode **/
#define RCC_AHB1LPENR_ETH1TXLPEN		(1 << 16)
/** RCC_AHB1LPENR_ETH1MACLPEN Ethernet MAC bus interface Clock Enable During CSleep Mode **/
#define RCC_AHB1LPENR_ETH1MACLPEN		(1 << 15)
/** RCC_AHB1LPENR_ADC12LPEN ADC1/2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_AHB1LPENR_ADC12LPEN		(1 << 5)
/** RCC_AHB1LPENR_DMA2LPEN DMA2 Clock Enable During CSleep Mode **/
#define RCC_AHB1LPENR_DMA2LPEN		(1 << 1)
/** RCC_AHB1LPENR_DMA1LPEN DMA1 Clock Enable During CSleep Mode **/
#define RCC_AHB1LPENR_DMA1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2lpenr AHB2LPENR RCC AHB2 Sleep Clock Register
@{*/

/** RCC_AHB2LPENR_SRAM3LPEN SRAM3 Clock Enable During CSleep Mode **/
#define RCC_AHB2LPENR_SRAM3LPEN		(1 << 31)
/** RCC_AHB2LPENR_SRAM2LPEN SRAM2 Clock Enable During CSleep Mode **/
#define RCC_AHB2LPENR_SRAM2LPEN		(1 << 30)
/** RCC_AHB2LPENR_SRAM1LPEN SRAM1 Clock Enable During CSleep Mode **/
#define RCC_AHB2LPENR_SRAM1LPEN		(1 << 29)
/** RCC_AHB2LPENR_SDMMC2LPEN SDMMC2 and SDMMC2 Delay Clock Enable During CSleep Mode **/
#define RCC_AHB2LPENR_SDMMC2LPEN		(1 << 9)
/** RCC_AHB2LPENR_RNGLPEN RNG peripheral clock enable during CSleep mode **/
#define RCC_AHB2LPENR_RNGLPEN		(1 << 6)
/** RCC_AHB2LPENR_HASHLPEN HASH peripheral clock enable during CSleep mode **/
#define RCC_AHB2LPENR_HASHLPEN		(1 << 5)
/** RCC_AHB2LPENR_CRYPTLPEN CRYPT peripheral clock enable during CSleep mode **/
#define RCC_AHB2LPENR_CRYPTLPEN		(1 << 4)
/** RCC_AHB2LPENR_CAMITFLPEN CAMITF peripheral clock enable during CSleep mode **/
#define RCC_AHB2LPENR_CAMITFLPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb4lpenr AHB4LPENR RCC AHB4 Sleep Clock Register
@{*/

/** RCC_AHB4LPENR_SRAM4LPEN SRAM4 Clock Enable During CSleep Mode **/
#define RCC_AHB4LPENR_SRAM4LPEN		(1 << 29)
/** RCC_AHB4LPENR_BKPRAMLPEN Backup RAM Clock Enable During CSleep Mode **/
#define RCC_AHB4LPENR_BKPRAMLPEN		(1 << 28)
/** RCC_AHB4LPENR_ADC3LPEN ADC3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_AHB4LPENR_ADC3LPEN		(1 << 24)
/** RCC_AHB4LPENR_BDMALPEN BDMA Clock Enable During CSleep Mode **/
#define RCC_AHB4LPENR_BDMALPEN		(1 << 21)
/** RCC_AHB4LPENR_CRCLPEN CRC peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_CRCLPEN		(1 << 19)
/** RCC_AHB4LPENR_GPIOKLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOKLPEN		(1 << 10)
/** RCC_AHB4LPENR_GPIOJLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOJLPEN		(1 << 9)
/** RCC_AHB4LPENR_GPIOILPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOILPEN		(1 << 8)
/** RCC_AHB4LPENR_GPIOHLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOHLPEN		(1 << 7)
/** RCC_AHB4LPENR_GPIOGLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOGLPEN		(1 << 6)
/** RCC_AHB4LPENR_GPIOFLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOFLPEN		(1 << 5)
/** RCC_AHB4LPENR_GPIOELPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOELPEN		(1 << 4)
/** RCC_AHB4LPENR_GPIODLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIODLPEN		(1 << 3)
/** RCC_AHB4LPENR_GPIOCLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOCLPEN		(1 << 2)
/** RCC_AHB4LPENR_GPIOBLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOBLPEN		(1 << 1)
/** RCC_AHB4LPENR_GPIOALPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_AHB4LPENR_GPIOALPEN		(1 << 0)

/**@}*/

