grevaillot/svd_tools/headers/STM32H7x5_CM7/rcc.h
/** RCC_C1_RSR_LPWRRSTF Reset due to illegal D1 DStandby or CPU CStop flag **/
#define RCC_C1_RSR_LPWRRSTF		(1 << 30)
/** RCC_C1_RSR_WWDG1RSTF Window Watchdog reset flag **/
#define RCC_C1_RSR_WWDG1RSTF		(1 << 28)
/** RCC_C1_RSR_IWDG1RSTF Independent Watchdog reset flag **/
#define RCC_C1_RSR_IWDG1RSTF		(1 << 26)
/** RCC_C1_RSR_SFTRSTF System reset from CPU reset flag **/
#define RCC_C1_RSR_SFTRSTF		(1 << 24)
/** RCC_C1_RSR_PORRSTF POR/PDR reset flag **/
#define RCC_C1_RSR_PORRSTF		(1 << 23)
/** RCC_C1_RSR_PINRSTF Pin reset flag (NRST) **/
#define RCC_C1_RSR_PINRSTF		(1 << 22)
/** RCC_C1_RSR_BORRSTF BOR reset flag **/
#define RCC_C1_RSR_BORRSTF		(1 << 21)
/** RCC_C1_RSR_D2RSTF D2 domain power switch reset flag **/
#define RCC_C1_RSR_D2RSTF		(1 << 20)
/** RCC_C1_RSR_D1RSTF D1 domain power switch reset flag **/
#define RCC_C1_RSR_D1RSTF		(1 << 19)
/** RCC_C1_RSR_CPURSTF CPU reset flag **/
#define RCC_C1_RSR_CPURSTF		(1 << 17)
/** RCC_C1_RSR_RMVF Remove reset flag **/
#define RCC_C1_RSR_RMVF		(1 << 16)

/**@}*/

/** @defgroup rcc_c1_ahb3enr C1AHB3ENR RCC AHB3 Clock Register
@{*/

/** RCC_C1_AHB3ENR_SDMMC1EN SDMMC1 and SDMMC1 Delay Clock Enable **/
#define RCC_C1_AHB3ENR_SDMMC1EN		(1 << 16)
/** RCC_C1_AHB3ENR_QSPIEN QUADSPI and QUADSPI Delay Clock Enable **/
#define RCC_C1_AHB3ENR_QSPIEN		(1 << 14)
/** RCC_C1_AHB3ENR_FMCEN FMC Peripheral Clocks Enable **/
#define RCC_C1_AHB3ENR_FMCEN		(1 << 12)
/** RCC_C1_AHB3ENR_JPGDECEN JPGDEC Peripheral Clock Enable **/
#define RCC_C1_AHB3ENR_JPGDECEN		(1 << 5)
/** RCC_C1_AHB3ENR_DMA2DEN DMA2D Peripheral Clock Enable **/
#define RCC_C1_AHB3ENR_DMA2DEN		(1 << 4)
/** RCC_C1_AHB3ENR_MDMAEN MDMA Peripheral Clock Enable **/
#define RCC_C1_AHB3ENR_MDMAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb1enr C1AHB1ENR RCC AHB1 Clock Register
@{*/

/** RCC_C1_AHB1ENR_USB2ULPIEN USB_PHY2 Clocks Enable **/
#define RCC_C1_AHB1ENR_USB2ULPIEN		(1 << 28)
/** RCC_C1_AHB1ENR_USB2OTGEN USB2OTG Peripheral Clocks Enable **/
#define RCC_C1_AHB1ENR_USB2OTGEN		(1 << 27)
/** RCC_C1_AHB1ENR_USB1ULPIEN USB_PHY1 Clocks Enable **/
#define RCC_C1_AHB1ENR_USB1ULPIEN		(1 << 26)
/** RCC_C1_AHB1ENR_USB1OTGEN USB1OTG Peripheral Clocks Enable **/
#define RCC_C1_AHB1ENR_USB1OTGEN		(1 << 25)
/** RCC_C1_AHB1ENR_ETH1RXEN Ethernet Reception Clock Enable **/
#define RCC_C1_AHB1ENR_ETH1RXEN		(1 << 17)
/** RCC_C1_AHB1ENR_ETH1TXEN Ethernet Transmission Clock Enable **/
#define RCC_C1_AHB1ENR_ETH1TXEN		(1 << 16)
/** RCC_C1_AHB1ENR_ETH1MACEN Ethernet MAC bus interface Clock Enable **/
#define RCC_C1_AHB1ENR_ETH1MACEN		(1 << 15)
/** RCC_C1_AHB1ENR_ADC12EN ADC1/2 Peripheral Clocks Enable **/
#define RCC_C1_AHB1ENR_ADC12EN		(1 << 5)
/** RCC_C1_AHB1ENR_DMA2EN DMA2 Clock Enable **/
#define RCC_C1_AHB1ENR_DMA2EN		(1 << 1)
/** RCC_C1_AHB1ENR_DMA1EN DMA1 Clock Enable **/
#define RCC_C1_AHB1ENR_DMA1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb2enr C1AHB2ENR RCC AHB2 Clock Register
@{*/

/** RCC_C1_AHB2ENR_SRAM3EN SRAM3 block enable **/
#define RCC_C1_AHB2ENR_SRAM3EN		(1 << 31)
/** RCC_C1_AHB2ENR_SRAM2EN SRAM2 block enable **/
#define RCC_C1_AHB2ENR_SRAM2EN		(1 << 30)
/** RCC_C1_AHB2ENR_SRAM1EN SRAM1 block enable **/
#define RCC_C1_AHB2ENR_SRAM1EN		(1 << 29)
/** RCC_C1_AHB2ENR_SDMMC2EN SDMMC2 and SDMMC2 delay clock enable **/
#define RCC_C1_AHB2ENR_SDMMC2EN		(1 << 9)
/** RCC_C1_AHB2ENR_RNGEN RNG peripheral clocks enable **/
#define RCC_C1_AHB2ENR_RNGEN		(1 << 6)
/** RCC_C1_AHB2ENR_HASHEN HASH peripheral clock enable **/
#define RCC_C1_AHB2ENR_HASHEN		(1 << 5)
/** RCC_C1_AHB2ENR_CRYPTEN CRYPT peripheral clock enable **/
#define RCC_C1_AHB2ENR_CRYPTEN		(1 << 4)
/** RCC_C1_AHB2ENR_CAMITFEN CAMITF peripheral clock enable **/
#define RCC_C1_AHB2ENR_CAMITFEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb4enr C1AHB4ENR RCC AHB4 Clock Register
@{*/

/** RCC_C1_AHB4ENR_BKPRAMEN Backup RAM Clock Enable **/
#define RCC_C1_AHB4ENR_BKPRAMEN		(1 << 28)
/** RCC_C1_AHB4ENR_HSEMEN HSEM peripheral clock enable **/
#define RCC_C1_AHB4ENR_HSEMEN		(1 << 25)
/** RCC_C1_AHB4ENR_ADC3EN ADC3 Peripheral Clocks Enable **/
#define RCC_C1_AHB4ENR_ADC3EN		(1 << 24)
/** RCC_C1_AHB4ENR_BDMAEN BDMA and DMAMUX2 Clock Enable **/
#define RCC_C1_AHB4ENR_BDMAEN		(1 << 21)
/** RCC_C1_AHB4ENR_CRCEN CRC peripheral clock enable **/
#define RCC_C1_AHB4ENR_CRCEN		(1 << 19)
/** RCC_C1_AHB4ENR_GPIOKEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOKEN		(1 << 10)
/** RCC_C1_AHB4ENR_GPIOJEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOJEN		(1 << 9)
/** RCC_C1_AHB4ENR_GPIOIEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOIEN		(1 << 8)
/** RCC_C1_AHB4ENR_GPIOHEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOHEN		(1 << 7)
/** RCC_C1_AHB4ENR_GPIOGEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOGEN		(1 << 6)
/** RCC_C1_AHB4ENR_GPIOFEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOFEN		(1 << 5)
/** RCC_C1_AHB4ENR_GPIOEEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOEEN		(1 << 4)
/** RCC_C1_AHB4ENR_GPIODEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIODEN		(1 << 3)
/** RCC_C1_AHB4ENR_GPIOCEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOCEN		(1 << 2)
/** RCC_C1_AHB4ENR_GPIOBEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOBEN		(1 << 1)
/** RCC_C1_AHB4ENR_GPIOAEN 0GPIO peripheral clock enable **/
#define RCC_C1_AHB4ENR_GPIOAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_apb3enr C1APB3ENR RCC APB3 Clock Register
@{*/

/** RCC_C1_APB3ENR_WWDG1EN WWDG1 Clock Enable **/
#define RCC_C1_APB3ENR_WWDG1EN		(1 << 6)
/** RCC_C1_APB3ENR_LTDCEN LTDC peripheral clock enable **/
#define RCC_C1_APB3ENR_LTDCEN		(1 << 3)

/**@}*/

/** @defgroup rcc_c1_apb1lenr C1APB1LENR RCC APB1 Clock Register
@{*/

/** RCC_C1_APB1LENR_USART8EN USART8 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_USART8EN		(1 << 31)
/** RCC_C1_APB1LENR_USART7EN USART7 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_USART7EN		(1 << 30)
/** RCC_C1_APB1LENR_DAC12EN DAC1&2 peripheral clock enable **/
#define RCC_C1_APB1LENR_DAC12EN		(1 << 29)
/** RCC_C1_APB1LENR_HDMICECEN HDMI-CEC peripheral clock enable **/
#define RCC_C1_APB1LENR_HDMICECEN		(1 << 27)
/** RCC_C1_APB1LENR_I2C3EN I2C3 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_I2C3EN		(1 << 23)
/** RCC_C1_APB1LENR_I2C2EN I2C2 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_I2C2EN		(1 << 22)
/** RCC_C1_APB1LENR_I2C1EN I2C1 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_I2C1EN		(1 << 21)
/** RCC_C1_APB1LENR_UART5EN UART5 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_UART5EN		(1 << 20)
/** RCC_C1_APB1LENR_UART4EN UART4 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_UART4EN		(1 << 19)
/** RCC_C1_APB1LENR_USART3EN USART3 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_USART3EN		(1 << 18)
/** RCC_C1_APB1LENR_USART2EN USART2 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_USART2EN		(1 << 17)
/** RCC_C1_APB1LENR_SPDIFRXEN SPDIFRX Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_SPDIFRXEN		(1 << 16)
/** RCC_C1_APB1LENR_SPI3EN SPI3 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_SPI3EN		(1 << 15)
/** RCC_C1_APB1LENR_SPI2EN SPI2 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_SPI2EN		(1 << 14)
/** RCC_C1_APB1LENR_LPTIM1EN LPTIM1 Peripheral Clocks Enable **/
#define RCC_C1_APB1LENR_LPTIM1EN		(1 << 9)
/** RCC_C1_APB1LENR_TIM14EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM14EN		(1 << 8)
/** RCC_C1_APB1LENR_TIM13EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM13EN		(1 << 7)
/** RCC_C1_APB1LENR_TIM12EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM12EN		(1 << 6)
/** RCC_C1_APB1LENR_TIM7EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM7EN		(1 << 5)
/** RCC_C1_APB1LENR_TIM6EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM6EN		(1 << 4)
/** RCC_C1_APB1LENR_TIM5EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM5EN		(1 << 3)
/** RCC_C1_APB1LENR_TIM4EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM4EN		(1 << 2)
/** RCC_C1_APB1LENR_TIM3EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM3EN		(1 << 1)
/** RCC_C1_APB1LENR_TIM2EN TIM peripheral clock enable **/
#define RCC_C1_APB1LENR_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_apb1henr C1APB1HENR RCC APB1 Clock Register
@{*/

/** RCC_C1_APB1HENR_FDCANEN FDCAN Peripheral Clocks Enable **/
#define RCC_C1_APB1HENR_FDCANEN		(1 << 8)
/** RCC_C1_APB1HENR_MDIOSEN MDIOS peripheral clock enable **/
#define RCC_C1_APB1HENR_MDIOSEN		(1 << 5)
/** RCC_C1_APB1HENR_OPAMPEN OPAMP peripheral clock enable **/
#define RCC_C1_APB1HENR_OPAMPEN		(1 << 4)
/** RCC_C1_APB1HENR_SWPEN SWPMI Peripheral Clocks Enable **/
#define RCC_C1_APB1HENR_SWPEN		(1 << 2)
/** RCC_C1_APB1HENR_CRSEN Clock Recovery System peripheral clock enable **/
#define RCC_C1_APB1HENR_CRSEN		(1 << 1)

/**@}*/

/** @defgroup rcc_c1_apb2enr C1APB2ENR RCC APB2 Clock Register
@{*/

/** RCC_C1_APB2ENR_HRTIMEN HRTIM peripheral clock enable **/
#define RCC_C1_APB2ENR_HRTIMEN		(1 << 29)
/** RCC_C1_APB2ENR_DFSDM1EN DFSDM1 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_DFSDM1EN		(1 << 28)
/** RCC_C1_APB2ENR_SAI3EN SAI3 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_SAI3EN		(1 << 24)
/** RCC_C1_APB2ENR_SAI2EN SAI2 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_SAI2EN		(1 << 23)
/** RCC_C1_APB2ENR_SAI1EN SAI1 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_SAI1EN		(1 << 22)
/** RCC_C1_APB2ENR_SPI5EN SPI5 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_SPI5EN		(1 << 20)
/** RCC_C1_APB2ENR_TIM17EN TIM17 peripheral clock enable **/
#define RCC_C1_APB2ENR_TIM17EN		(1 << 18)
/** RCC_C1_APB2ENR_TIM16EN TIM16 peripheral clock enable **/
#define RCC_C1_APB2ENR_TIM16EN		(1 << 17)
/** RCC_C1_APB2ENR_TIM15EN TIM15 peripheral clock enable **/
#define RCC_C1_APB2ENR_TIM15EN		(1 << 16)
/** RCC_C1_APB2ENR_SPI4EN SPI4 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_SPI4EN		(1 << 13)
/** RCC_C1_APB2ENR_SPI1EN SPI1 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_SPI1EN		(1 << 12)
/** RCC_C1_APB2ENR_USART6EN USART6 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_USART6EN		(1 << 5)
/** RCC_C1_APB2ENR_USART1EN USART1 Peripheral Clocks Enable **/
#define RCC_C1_APB2ENR_USART1EN		(1 << 4)
/** RCC_C1_APB2ENR_TIM8EN TIM8 peripheral clock enable **/
#define RCC_C1_APB2ENR_TIM8EN		(1 << 1)
/** RCC_C1_APB2ENR_TIM1EN TIM1 peripheral clock enable **/
#define RCC_C1_APB2ENR_TIM1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_apb4enr C1APB4ENR RCC APB4 Clock Register
@{*/

/** RCC_C1_APB4ENR_SAI4EN SAI4 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_SAI4EN		(1 << 21)
/** RCC_C1_APB4ENR_RTCAPBEN RTC APB Clock Enable **/
#define RCC_C1_APB4ENR_RTCAPBEN		(1 << 16)
/** RCC_C1_APB4ENR_VREFEN VREF peripheral clock enable **/
#define RCC_C1_APB4ENR_VREFEN		(1 << 15)
/** RCC_C1_APB4ENR_COMP12EN COMP1/2 peripheral clock enable **/
#define RCC_C1_APB4ENR_COMP12EN		(1 << 14)
/** RCC_C1_APB4ENR_LPTIM5EN LPTIM5 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_LPTIM5EN		(1 << 12)
/** RCC_C1_APB4ENR_LPTIM4EN LPTIM4 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_LPTIM4EN		(1 << 11)
/** RCC_C1_APB4ENR_LPTIM3EN LPTIM3 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_LPTIM3EN		(1 << 10)
/** RCC_C1_APB4ENR_LPTIM2EN LPTIM2 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_LPTIM2EN		(1 << 9)
/** RCC_C1_APB4ENR_I2C4EN I2C4 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_I2C4EN		(1 << 7)
/** RCC_C1_APB4ENR_SPI6EN SPI6 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_SPI6EN		(1 << 5)
/** RCC_C1_APB4ENR_LPUART1EN LPUART1 Peripheral Clocks Enable **/
#define RCC_C1_APB4ENR_LPUART1EN		(1 << 3)
/** RCC_C1_APB4ENR_SYSCFGEN SYSCFG peripheral clock enable **/
#define RCC_C1_APB4ENR_SYSCFGEN		(1 << 1)

/**@}*/

/** @defgroup rcc_c1_ahb3lpenr C1AHB3LPENR RCC AHB3 Sleep Clock Register
@{*/

/** RCC_C1_AHB3LPENR_AXISRAMLPEN AXISRAM Block Clock Enable During CSleep mode **/
#define RCC_C1_AHB3LPENR_AXISRAMLPEN		(1 << 31)
/** RCC_C1_AHB3LPENR_ITCMLPEN D1ITCM Block Clock Enable During CSleep mode **/
#define RCC_C1_AHB3LPENR_ITCMLPEN		(1 << 30)
/** RCC_C1_AHB3LPENR_DTCM2LPEN D1 DTCM2 Block Clock Enable During CSleep mode **/
#define RCC_C1_AHB3LPENR_DTCM2LPEN		(1 << 29)
/** RCC_C1_AHB3LPENR_D1DTCM1LPEN D1DTCM1 Block Clock Enable During CSleep mode **/
#define RCC_C1_AHB3LPENR_D1DTCM1LPEN		(1 << 28)
/** RCC_C1_AHB3LPENR_SDMMC1LPEN SDMMC1 and SDMMC1 Delay Clock Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_SDMMC1LPEN		(1 << 16)
/** RCC_C1_AHB3LPENR_QSPILPEN QUADSPI and QUADSPI Delay Clock Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_QSPILPEN		(1 << 14)
/** RCC_C1_AHB3LPENR_FMCLPEN FMC Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_FMCLPEN		(1 << 12)
/** RCC_C1_AHB3LPENR_FLITFLPEN FLITF Clock Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_FLITFLPEN		(1 << 8)
/** RCC_C1_AHB3LPENR_JPGDECLPEN JPGDEC Clock Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_JPGDECLPEN		(1 << 5)
/** RCC_C1_AHB3LPENR_DMA2DLPEN DMA2D Clock Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_DMA2DLPEN		(1 << 4)
/** RCC_C1_AHB3LPENR_MDMALPEN MDMA Clock Enable During CSleep Mode **/
#define RCC_C1_AHB3LPENR_MDMALPEN		(1 << 0)

/**@}*/

